Tekla Open API Reference for Tekla Structures 2025
Operation.Split Method (RebarGroup, Line)
 Splits the rebar group and creates a new one in the given position.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static RebarGroup Split(
	RebarGroup Object,
	Line SplitLine
)
Public Shared Function Split (
	Object As RebarGroup,
	SplitLine As Line
) As RebarGroup
Parameters
Object
Type: Tekla.Structures.Model.RebarGroup
The rebar group object to be splitted.
SplitLine
Type: Tekla.Structures.Geometry3d.Line
The line where splitting is executed.
Return Value
Type: RebarGroup
The created rebar group on success, null on failure.
See Also
Reference
Operation Class
Split Overload
Tekla.Structures.Model.Operations Namespace